ms_rails/app/controllers/celebrities_controller.rb

SELECT * FROM `celebrities`
---
  def index
    @celebrities = Celebrity.all

SELECT * FROM `celebrities` WHERE (`celebrities`.`id` = 1)
---
  def show
    @celebrity = Celebrity.find(params[:id])

SELECT * FROM `celebrities` WHERE (`celebrities`.`id` = 1)
---
  def edit
    @celebrity = Celebrity.find(params[:id])