ms_rails/app/controllers/copies_controller.rb

  def index
    @copies = Copy.all
---
SELECT * FROM `copies`

  def show
    @copy = Copy.find(params[:id])
---
SELECT * FROM `copies` WHERE (`copies`.`id` = 12)

  def edit
    @copy = Copy.find(params[:id])
---
SELECT * FROM `copies` WHERE (`copies`.`id` = 11)