ms_rails/app/controllers/customers_controller.rb

  def index
    @customers = Customer.all
---
SELECT * FROM `customers` LIMIT 1

  def show
    @customer = Customer.find(params[:id])
---
SELECT * FROM "customers" WHERE ("customers"."id" = 1)

  def edit
    @customer = Customer.find(params[:id])
---
SELECT * FROM "customers" WHERE ("customers"."id" = 1)

  def create
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("city", "street_1", "zip", "created_at", "street_2", "updated_at", "last_name", "phone", "first_name", "email") VALUES(NULL, NULL, NULL, '2009-11-14 06:37:50', NULL, '2009-11-14 06:37:50', 'Connolly', NULL, 'Orla', NULL)

  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy
---
SELECT * FROM "customers" WHERE ("customers"."id" = 1)
DELETE FROM "customers" WHERE "id" = 1