ms_rails/app/controllers/sales_controller.rb

SELECT * FROM `sales`
---
  def index
    @sales = Sale.all